# Ответы бота
START_MESSAGE_FOR_NEW = 'Привет! Я бот для управления каналами в Telegram.'
START_MESSAGE_FOR_OLD = 'Рады снова вас приветствовать!'
ADD_CHANNELS_MESSAGE = 'Напишите ссылку одного или нескольких каналов через запятую. Вы можете использовать формат https://t.me/название_канала или @название_канала'
DELETE_CHANNEL_MESSAGE = 'Нажмите на канал из списка, который хотите удалить'
EMPTY_LIST_CHANNELS_MESSAGE = 'Список каналов пуст'
CHANNELS_ADDED_MESSAGE = 'Были добавлены каналы: {channels_added}\n'
CHANNELS_NOT_ADDED_MESSAGE = 'Не удалось добавить каналы: {channels_not_added}\n'
CHANNELS_ALREADY_ADDED_MESSAGE = 'Каналы уже были добавлены ранее: {channels_already_added}\n'
POST_FROM_CHANNEL_MESSAGE = '\n\nПост с канала @{channel_username}'
ADDED_CHANNELS_MESSAGE = 'Добавленные каналы:\n{usernames}'

# Категории
CATEGORIES = {
    0: 'Животные',
    1: 'Игры',
    2: 'Инвестиции',
    3: 'Спорт',
    4: 'Наука',
    5: 'Машины',
    6: 'IT',
    7: 'Техника',
    8: 'Финансы',
    9: 'Путешествия',
    10: 'Мемы',
    11: 'Криптовалюта',
    12: 'Фильмы',
    13: 'Аниме'
}

CATEGORIES_EMOJI = {
    CATEGORIES[0]: '🐶',
    CATEGORIES[1]: '🎮',
    CATEGORIES[2]: '📈',
    CATEGORIES[3]: '⚽',
    CATEGORIES[4]: '🔬',
    CATEGORIES[5]: '🚗',
    CATEGORIES[6]: '👨‍💻',
    CATEGORIES[7]: '⚙',
    CATEGORIES[8]: '💸',
    CATEGORIES[9]: '🌎',
    CATEGORIES[10]: '😂',
    CATEGORIES[11]: '₿',
    CATEGORIES[12]: '🎬',
    CATEGORIES[13]: '🉐',
}
