# Ответы бота
GUIDE_MESSAGE_TEXT = '''* <b>По кнопкам ❤️/👎</b> автоматически выдаётся следующий пост. Если не хотите ставить реакцию, нажмите кнопку «<code>Далее</code>».

* <u><b>Лента рекомендаций</b></u> включает в себя самые популярные и интересные посты.

* <u><b>Лента категорий</b></u> cоздана для просмотра каналов по твоим любимым категориям (их в любой момент можно изменить).

* <u><b>Личная лента</b></u> cоздана для добавления своих каналов и просмотра постов без перехода из канала в канал.

**<i>Отправь сообщение с названиями любимых каналов, записанными через запятую, и подожди, пока бот добавит их в базу и получит посты (это недолго😉).
После этого можешь начинать листать <b>личную ленту</b>. <u>Посты обновляются автоматически по мере их выхода в канале</u></i>**

<b>❗️К сожалению, пока что мы не можем добавить закрытые каналы</b>
'''

NEW_START_MESSAGE_TEXT = f'''<b>Привет!</b> 
Мы делаем этот проект для твоего удобства. Для дальнейшей простоты использования <i><u>прочитай небольшую инструкцию</u></i>. (К ней ты всегда можете вернуться с помощью команды <code>/guide</code> в «Меню» или просто отправив сообщение <code>/guide</code> боту) 👇

{GUIDE_MESSAGE_TEXT}
<i><b>Спасибо, что ты с нами🤜🤛
Приятного скроллинга❤️</b></i>
'''

ADD_CHANNELS_MESSAGE_TEXT = 'Напишите ссылку или название одного или нескольких каналов через запятую. Вы можете использовать эти форматы: https://t.me/название_канала, @название_канала или название_канала.'
DELETE_CHANNEL_MESSAGE_TEXT = 'Нажмите на канал, который хотите удалить.'
POSTS_OVER = 'Посты закончились 😩.'
PRE_SCROLL_MESSAGE_TEXT = 'Получаем посты...'

CATEGORIES_FEED_MESSAGE_TEXT = '<b>Лента категорий</b>'
RECOMMENDATIONS_FEED_MESSAGE_TEXT = '<b>Лента рекомендаций</b>'
PERSONAL_FEED_MESSAGE_TEXT = '<b>Личная лента</b>'
ADMIN_PANEL_MESSAGE_TEXT = '<b>Админ панель</b>'

#
# RATES_MESSAGE_TEXT = '''<b>Тарифы</b>:
#
# 1) <b><i>Стартовый</i></b> (доступен для канала 1 раз)
# Добавление канала в категории на неделю с коэффициентом макс. На три дня
# Стоимость - <b>100₽</b>
#
# 2) <b><i>Базовый</i></b>
# Добавление канала в категории на неделю с коэф мин. на пять дней
# Стоимость - <b>125₽</b>
#
# 3) <b><i>Оптимальный</i></b>
# Добавление канала в категории на две недели
# Добавление канала в рекомендации с коэф средний на пять дней
# Стоимость - <b>150₽</b>
#
# 4) <b><i>Максимальный</i></b>
# Добавление канала в категории на неделю с макс коэффициентом
# Добавление канала в рекомендации с коэф макс на пять дней
# Стоимость - <b>300₽</b>
#
# 5) <b><i>Статичный</i></b>
# • Добавление канала в категории на неделю (<b>50₽</b>)
# • Добавление канала в категории на две недели (<b>75₽</b>)'''
