# Ответы бота
NEW_START_MESSAGE_TEXT = 'Приветствуем тебя в {bot_username}👾\nМы создали его для твоего удобства, чтобы тебе было проще и интереснее пользоваться Telegram’ом\nКайфового скроллинга🫰'
ADD_CHANNELS_MESSAGE_TEXT = 'Напишите ссылку или название одного или нескольких каналов через запятую. Вы можете использовать эти форматы: https://t.me/название_канала, @название_канала или название_канала.'
DELETE_CHANNEL_MESSAGE_TEXT = 'Нажмите на канал, который хотите удалить.'
POSTS_OVER = 'Посты закончились 😩.'
PRE_SCROLL_MESSAGE_TEXT = 'Получаем посты...'

CATEGORIES_FEED_MESSAGE_TEXT = '<b>Лента категорий</b>'
RECOMMENDATIONS_FEED_MESSAGE_TEXT = '<b>Лента рекомендаций</b>'
PERSONAL_FEED_MESSAGE_TEXT = '<b>Личная лента</b>'
ADMIN_PANEL_MESSAGE_TEXT = '<b>Админ панель</b>'
