# Ответы бота
NEW_START_MESSAGE_TEXT = '''Привет! 
Мы делаем этот проект для твоего удобства. Для дальнейшей простоты использования прочитай небольшую инструкцию 👇

Лента рекомендаций - включает в себя самые популярные и интересные посты

Лента категорий - Создана для просмотра каналов по твоим любимым категориям (их в любой момент можно изменить) 

Личная лента - Создана для добавления своих каналов и просмотра постов в рандомном порядке без перехода из канала в канал

Спасибо что выбрал нас 🤝
Приятного скроллинга ❤️'''

ADD_CHANNELS_MESSAGE_TEXT = 'Напишите ссылку или название одного или нескольких каналов через запятую. Вы можете использовать эти форматы: https://t.me/название_канала, @название_канала или название_канала.'
DELETE_CHANNEL_MESSAGE_TEXT = 'Нажмите на канал, который хотите удалить.'
POSTS_OVER = 'Посты закончились 😩.'
PRE_SCROLL_MESSAGE_TEXT = 'Получаем посты...'

CATEGORIES_FEED_MESSAGE_TEXT = '<b>Лента категорий</b>'
RECOMMENDATIONS_FEED_MESSAGE_TEXT = '<b>Лента рекомендаций</b>'
PERSONAL_FEED_MESSAGE_TEXT = '<b>Личная лента</b>'
ADMIN_PANEL_MESSAGE_TEXT = '<b>Админ панель</b>'

RATES_MESSAGE_TEXT = '''<b>Тарифы</b>: 

1) <b><i>Стартовый</i></b> (доступен для канала 1 раз) 
Добавление канала в категории на неделю с коэффициентом макс. На три дня
Стоимость - <b>100₽</b>

2) <b><i>Базовый</i></b>
Добавление канала в категории на неделю с коэф мин. на пять дней 
Стоимость - <b>125₽</b>

3) <b><i>Оптимальный</i></b> 
Добавление канала в категории на две недели
Добавление канала в рекомендации с коэф средний на пять дней
Стоимость - <b>150₽</b>

4) <b><i>Максимальный</i></b> 
Добавление канала в категории на неделю с макс коэффициентом 
Добавление канала в рекомендации с коэф макс на пять дней 
Стоимость - <b>300₽</b>

5) <b><i>Статичный</i></b> 
• Добавление канала в категории на неделю (<b>50₽</b>)
• Добавление канала в категории на две недели (<b>75₽</b>)'''